## Titanic Dataset
### Dataset Features:
1. survived: Whether the passenger survived (0 = No, 1 = Yes).
2. pclass: Ticket class (1 = 1st, 2 = 2nd, 3 = 3rd).
3. sex: Gender of the passenger.
4. age: Age of the passenger in years. Some values are missing.
5. sibsp: Number of siblings/spouses aboard the Titanic.
6. parch: Number of parents/children aboard the Titanic.
7. fare: Passenger fare.
8. embarked: Port of embarkation (C = Cherbourg; Q = Queenstown; S = Southampton).
9. class: Duplicate of 'pclass' (used for plotting by Seaborn).
10. who: Describes whether the passenger is a man, woman, or child.
11. adult_male: Indicates whether the passenger is an adult male (True/False).
12. deck: The deck the passenger was on (missing for many passengers).
13. embark_town: The name of the town where the passenger boarded.
14. alive: Indicator of whether the passenger survived (Yes/No, derived from 'survived').
15. alone: Indicates whether the passenger was traveling alone (True/False).

In [11]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

Loading the datasets onto the notebook

In [12]:
dataSet=sns.load_dataset('titanic')

In [13]:
dataSet.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [15]:
dataSet.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [14]:
print("Random sample from the dataset: ")
dataSet.sample(20)

Random sample from the dataset:

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
610,0,3,female,39.0,1,5,31.2750,S,Third,woman,False,NaN,Southampton,no,False
328,1,3,female,31.0,1,1,20.5250,S,Third,woman,False,NaN,Southampton,yes,False
198,1,3,female,NaN,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,yes,True
778,0,3,male,NaN,0,0,7.7375,Q,Third,man,True,NaN,Queenstown,no,True
723,0,2,male,50.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
868,0,3,male,NaN,0,0,9.5000,S,Third,man,True,NaN,Southampton,no,True
64,0,1,male,NaN,0,0,27.7208,C,First,man,True,NaN,Cherbourg,no,True
259,1,2,female,50.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
196,0,3,male,NaN,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True
528,0,3,male,39.0,0,0,7.9250,S,Third,man,True,NaN,Southampton,no,True
828,1,3,male,NaN,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,yes,True
21,1,2,male,34.0,0,0,13.0000,S,Second,man,True,D,Southampton,yes,True
331,0,1,male,45.5,0,0,28.5000,S,First,man,True,C,Southampton,no,True
124,0,1,male,54.0,0,1,77.2875,S,First,man,True,D,Southampton,no,False
573,1,3,female,NaN,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,yes,True
709,1,3,male,NaN,1,1,15.2458,C,Third,man,True,NaN,Cherbourg,yes,False
394,1,3,female,24.0,0,2,16.7000,S,Third,woman,False,G,Southampton,yes,False
292,0,2,male,36.0,0,0,12.8750,C,Second,man,True,D,Cherbourg,no,True
315,1,3,female,26.0,0,0,7.8542,S,Third,woman,False,NaN,Southampton,yes,True
862,1,1,female,48.0,0,0,25.9292,S,First,woman,False,D,Southampton,yes,True

We can see that some values in the Age column are null.
Additionally,we have some redudant values

### Data Cleaning
#### Removing redundant columns
The "alive" column and the "survived" column are one in the same so we need to get rid of one. The same applies to the embark and embacked_town column.

In [ ]:
#We will check if the two columns are identical
are_identical = dataSet['survived'].equals(dataSet['alive'].apply(lambda x:1 if x== 'yes' else 0))
print(f"Are the 'survived' and 'alive' identical? {are_identical}")

Are the 'survived' and 'alive' identical? True

In [22]:
are_identical2=dataSet['embarked'].equals(dataSet['embark_town'].apply(lambda x:1 if x== 'yes' else 0))
print(f"Are 'embarked' and 'embarked_town' identical? {are_identical2}")

Are 'embarked' and 'embarked_town' identical? False

The embark and embarked_town values are not identical meaning that there are unique values in both columns

In [23]:
# Check unique values in both columns
print("Unique values in 'embarked':", dataSet['embarked'].unique())
print("Unique values in 'embark_town':", dataSet['embark_town'].unique())

Unique values in 'embarked': ['S' 'C' 'Q' nan]
Unique values in 'embark_town': ['Southampton' 'Cherbourg' 'Queenstown' nan]

In [30]:
embarked_mapping = {'S':'Southampton','C':'Cherbourg','Q':'Queenstown'}
dataSet['embarked_mapped']=dataSet['embarked'].map(embarked_mapping)

In [31]:
are_identical=dataSet['embarked_mapped'].equals(dataSet['embark_town'])
print(f"Are 'embarked' and 'embark_town' identical? {are_identical}")

Are 'embarked' and 'embark_town' identical? True

We will drop the "extra" columns

In [32]:
dataSet.drop('alive',axis=1,inplace=True)
dataSet.drop('embark_town',axis=1,inplace=True)
dataSet.drop('embarked_mapped',axis=1,inplace=True)
dataSet.drop('class',axis=1,inplace=True)

In [34]:
#The new dataset
dataSet.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   survived    891 non-null    int64
 1   pclass      891 non-null    int64
 2   sex         891 non-null    object
 3   age         714 non-null    float64
 4   sibsp       891 non-null    int64
 5   parch       891 non-null    int64
 6   fare        891 non-null    float64
 7   embarked    889 non-null    object
 8   who         891 non-null    object
 9   adult_male  891 non-null    bool
 10  deck        203 non-null    category
 11  alone       891 non-null    bool
dtypes: bool(2), category(1), float64(2), int64(4), object(3)
memory usage: 65.7+ KB

In [36]:
dataSet.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,who,adult_male,deck,alone
0,0,3,male,22.0,1,0,7.2500,S,man,True,NaN,False
1,1,1,female,38.0,1,0,71.2833,C,woman,False,C,False
2,1,3,female,26.0,0,0,7.9250,S,woman,False,NaN,True
3,1,1,female,35.0,1,0,53.1000,S,woman,False,C,False
4,0,3,male,35.0,0,0,8.0500,S,man,True,NaN,True
5,0,3,male,NaN,0,0,8.4583,Q,man,True,NaN,True
6,0,1,male,54.0,0,0,51.8625,S,man,True,E,True
7,0,3,male,2.0,3,1,21.0750,S,child,False,NaN,False
8,1,3,female,27.0,0,2,11.1333,S,woman,False,NaN,False
9,1,2,female,14.0,1,0,30.0708,C,child,False,NaN,False